app/controllers/school_classes_controller.rb

	def index
		@school_classes = SchoolClass.all
---
SELECT  "school_classes".* FROM "school_classes" ORDER BY "school_classes"."id" ASC LIMIT ?  [["LIMIT", 1]]

	def create
	  @school_class = SchoolClass.new
	  @school_class.title = params[:school_class][:title]
	  @school_class.room_number = params[:school_class][:room_number]
	  @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "English"], ["room_number", 123]]

	def update
	  @school_class = SchoolClass.find(params[:id])
	  @school_class.update(params.require(:school_class).permit(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ? WHERE "school_classes"."id" = ?  [["room_number", 999], ["id", 1]]