app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Slim"], ["updated_at", "2020-05-20 20:59:34.167277"], ["id", 1]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(student_params)